[{"Plot": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart with the help from others on her side.", "Rated": "PG-13", "Title": "Insurgent", "Writer": "Brian Duffield (screenplay), Akiva Goldsman (screenplay), Mark Bomback (screenplay), Veronica Roth (novel)", "Actors": "Kate Winslet, Jai Courtney, Mekhi Phifer, Shailene Woodley", "Type": "movie", "imdbVotes": "47336", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTgxOTYxMTg3OF5BMl5BanBnXkFtZTgwMDgyMzA2NDE@._V1_SX300.jpg", "Director": "Robert Schwentke", "Released": "20 Mar 2015", "Awards": "1 nomination.", "Genre": "Adventure, Sci-Fi, Thriller", "imdbRating": "6.9", "Language": "English", "Country": "USA", "Synopsis": "One choice can transform you-or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves--and herself--while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love. Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable--and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships. Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.", "Runtime": "119 min", "Trailer": "https://www.youtube.com/watch?v=suZcGoRLXkU", "imdbID": "tt2908446", "Metascore": "42", "Year": "2015"}, {"Plot": "In a stark desert landscape where humanity is broken, two rebels just might be able to restore order: Max, a man of action and of few words, and Furiosa, a woman of action who is looking to make it back to her childhood homeland.", "Rated": "R", "Title": "Mad Max: Fury Road", "Writer": "George Miller, Brendan McCarthy, Nick Lathouris", "Actors": "Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne", "Type": "movie", "imdbVotes": "226488", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTUyMTE0ODcxNF5BMl5BanBnXkFtZTgwODE4NDQzNTE@._V1_SX300.jpg", "Director": "George Miller", "Released": "15 May 2015", "Awards": "N/A", "Genre": "Action, Adventure, Sci-Fi", "imdbRating": "8.5", "Language": "English, Russian", "Country": "Australia, USA", "Synopsis": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and almost everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.", "Runtime": "120 min", "Trailer": "https://www.youtube.com/watch?v=vjBb4SZ0F6Q", "imdbID": "tt1392190", "Metascore": "89", "Year": "2015"}, {"Plot": "Sriracha has earned a cult following, but the story of this spicy sauce is a mystery to most fans. Dedicated to Sriracha lovers, this documentary travels around the globe to reveal its origin and the man behind the iconic \"rooster sauce.\"", "Rated": "N/A", "Title": "Sriracha", "Writer": "Griffin Hammond", "Actors": "Randy Clemens, Jordan Crowder, Harold Dieterle, Adam Holliday", "Type": "movie", "imdbVotes": "204", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTM4MzM3MTIzNF5BMl5BanBnXkFtZTgwOTMzNDE0MDE@._V1_SX300.jpg", "Director": "Griffin Hammond", "Released": "11 Dec 2013", "Awards": "N/A", "Genre": "Documentary, Short, Biography", "imdbRating": "7.5", "Language": "English", "Country": "Thailand, USA", "Synopsis": "Sriracha has earned a cult following, but the story of this spicy sauce is a mystery to most fans. Dedicated to Sriracha lovers, this fast-paced documentary travels around the globe to reveal its origin and the man behind the iconic 'rooster sauce.'", "Runtime": "33 min", "Trailer": "https://www.youtube.com/watch?v=FIVKzPU8nfg", "imdbID": "tt2992302", "Metascore": "N/A", "Year": "2013"}, {"Plot": "Literature student Anastasia Steele's life changes forever when she meets handsome, yet tormented, billionaire Christian Grey.", "Rated": "R", "Title": "Fifty Shades of Grey", "Writer": "Kelly Marcel (screenplay), E.L. James (novel)", "Actors": "Dakota Johnson, Jamie Dornan, Jennifer Ehle, Eloise Mumford", "Type": "movie", "imdbVotes": "167612", "Poster": "http://ia.media-imdb.com/images/M/MV5BMjE1MTM4NDAzOF5BMl5BanBnXkFtZTgwNTMwNjI0MzE@._V1_SX300.jpg", "Director": "Sam Taylor-Johnson", "Released": "13 Feb 2015", "Awards": "1 nomination.", "Genre": "Drama, Romance", "imdbRating": "4.2", "Language": "English", "Country": "USA", "Synopsis": "When Anastasia Steele, a literature student, goes to interview the wealthy Christian Grey as a favor to her roommate Kate Kavanagh, she encounters a beautiful, brilliant and intimidating man. The innocent and naive Ana starts to realize she wants him. Despite his enigmatic reserve and advice, she finds herself desperate to get close to him. Not able to resist Ana's beauty and independent spirit, Christian Grey admits he wants her too, but on his own terms. Ana hesitates as she discovers the singular tastes of Christian Grey - despite the embellishments of success, his multinational businesses, his vast wealth, and his loving family, Grey is consumed by the need to control everything.", "Runtime": "125 min", "Trailer": "https://www.youtube.com/watch?v=SfZWFDs0LxA", "imdbID": "tt2322441", "Metascore": "46", "Year": "2015"}, {"Plot": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.", "Rated": "PG-13", "Title": "Interstellar", "Writer": "Jonathan Nolan, Christopher Nolan", "Actors": "Ellen Burstyn, Matthew McConaughey, Mackenzie Foy, John Lithgow", "Type": "movie", "imdbVotes": "645963", "Poster": "http://ia.media-imdb.com/images/M/MV5BMjIxNTU4MzY4MF5BMl5BanBnXkFtZTgwMzM4ODI3MjE@._V1_SX300.jpg", "Director": "Christopher Nolan", "Released": "7 Nov 2014", "Awards": "Won 1 Oscar. Another 38 wins & 103 nominations.", "Genre": "Adventure, Sci-Fi", "imdbRating": "8.7", "Language": "English", "Country": "USA, UK, Canada", "Synopsis": "In the near future, Earth has been devastated by drought and famine, causing a scarcity in food and extreme changes in climate. When humanity is facing extinction, a mysterious rip in the space-time continuum is discovered, giving mankind the opportunity to widen its lifespan. A group of explorers must travel beyond our solar system in search of a planet that can sustain life. The crew of the Endurance are required to think bigger and go further than any human in history as they embark on an interstellar voyage into the unknown. Coop, the pilot of the Endurance, must decide between seeing his children again and the future of the human race.", "Runtime": "169 min", "Trailer": "https://www.youtube.com/watch?v=Lm8p5rlrSkY", "imdbID": "tt0816692", "Metascore": "74", "Year": "2014"}, {"Plot": "Ex-government operative Bryan Mills is accused of a ruthless murder he never committed or witnessed. As he is tracked and pursued, Mills brings out his particular set of skills to find the true killer and clear his name.", "Rated": "PG-13", "Title": "Taken 3", "Writer": "Luc Besson, Robert Mark Kamen, Luc Besson (characters), Robert Mark Kamen (characters)", "Actors": "Liam Neeson, Forest Whitaker, Famke Janssen, Maggie Grace", "Type": "movie", "imdbVotes": "95849", "Poster": "http://ia.media-imdb.com/images/M/MV5BNjM5MDU3NTY0M15BMl5BanBnXkFtZTgwOTk2ODU2MzE@._V1_SX300.jpg", "Director": "Olivier Megaton", "Released": "9 Jan 2015", "Awards": "N/A", "Genre": "Action, Thriller", "imdbRating": "6.1", "Language": "English, Russian", "Country": "France", "Synopsis": "Liam Neeson returns as ex-covert operative Bryan Mills, whose long awaited reconciliation with his ex-wife is tragically cut short when she is brutally murdered. Consumed with rage, and framed for the crime, he goes on the run to evade the relentless pursuit of the CIA, FBI and the police. For one last time, Mills must use his \"particular set of skills,\" to track down the real killers, exact his unique brand of justice, and protect the only thing that matters to him now - his daughter.", "Runtime": "109 min", "Trailer": "https://www.youtube.com/watch?v=r0EPt7-J1eY", "imdbID": "tt2446042", "Metascore": "26", "Year": "2014"}, {"Plot": "When Mother Malkin, the queen of evil witches, escapes the pit she was imprisoned in by professional monster hunter Spook decades ago and kills his apprentice, he recruits young Tom, the seventh son of the seventh son, to help him.", "Rated": "PG-13", "Title": "Seventh Son", "Writer": "Charles Leavitt (screenplay), Steven Knight (screenplay), Matt Greenberg (screen story), Joseph Delaney (novel)", "Actors": "Jeff Bridges, Ben Barnes, Julianne Moore, Alicia Vikander", "Type": "movie", "imdbVotes": "35021", "Poster": "http://ia.media-imdb.com/images/M/MV5BMjAxNTg2MDkyN15BMl5BanBnXkFtZTgwNzA3NzY1MjE@._V1_SX300.jpg", "Director": "Sergey Bodrov", "Released": "6 Feb 2015", "Awards": "N/A", "Genre": "Action, Adventure, Fantasy", "imdbRating": "5.5", "Language": "English", "Country": "USA, UK, Canada, China", "Synopsis": "John Gregory, who is a seventh son of a seventh son and also the local spook, has protected his country from witches, boggarts, ghouls and all manner of things that go bump in the night. However John is not young anymore, and has been seeking an apprentice to carry on his trade. Most have failed to survive. The last hope is a young farmer's son named Thomas Ward. Will he survive the training to become the spook that so many others couldn't? Should he trust the girl with pointy shoes? How can Thomas stand a chance against Mother Malkin, the most dangerous witch in the county?", "Runtime": "102 min", "Trailer": "https://www.youtube.com/watch?v=TXiNkOjM7oM", "imdbID": "tt1121096", "Metascore": "30", "Year": "2014"}, {"Plot": "The special bond that develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.", "Rated": "PG", "Title": "Big Hero 6", "Writer": "Jordan Roberts (screenplay), Robert L. Baird (screenplay), Daniel Gerson (screenplay), Duncan Rouleau (Big Hero 6 team and characters created by), Steven T. Seagle (Big Hero 6 team and characters created by), Joseph Mateo (head of story), Paul Briggs (head of story)", "Actors": "Scott Adsit, Ryan Potter, Daniel Henney, T.J. Miller", "Type": "movie", "imdbVotes": "176524", "Poster": "http://ia.media-imdb.com/images/M/MV5BMjI4MTIzODU2NV5BMl5BanBnXkFtZTgwMjE0NDAwMjE@._V1_SX300.jpg", "Director": "Don Hall, Chris Williams", "Released": "7 Nov 2014", "Awards": "Won 1 Oscar. Another 16 wins & 45 nominations.", "Genre": "Animation, Action, Adventure", "imdbRating": "7.9", "Language": "English", "Country": "USA", "Synopsis": "From Walt Disney Animation Studios, the team behind \"Frozen\" and \"Wreck-It Ralph,\" comes \"Big Hero 6,\" an action-packed comedy-adventure about the special bond that develops between Baymax, a plus-sized inflatable robot, and prodigy Hiro Hamada. When a devastating event befalls the city of San Fransokyo and catapults Hiro into the midst of danger, he turns to Baymax and his close friends adrenaline junkie Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred. Determined to uncover the mystery, Hiro transforms his friends into a band of high-tech heroes called \"Big Hero 6.\"", "Runtime": "102 min", "Trailer": "https://www.youtube.com/watch?v=d2S8D_SCAJY", "imdbID": "tt2245084", "Metascore": "74", "Year": "2014"}, {"Plot": "A group of intergalactic criminals are forced to work together to stop a fanatical warrior from taking control of the universe.", "Rated": "PG-13", "Title": "Guardians of the Galaxy", "Writer": "James Gunn, Nicole Perlman, Dan Abnett (comic book), Andy Lanning (comic book)", "Actors": "Chris Pratt, Zoe Saldana, Dave Bautista, Vin Diesel", "Type": "movie", "imdbVotes": "503909", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTAwMjU5OTgxNjZeQTJeQWpwZ15BbWU4MDUxNDYxODEx._V1_SX300.jpg", "Director": "James Gunn", "Released": "1 Aug 2014", "Awards": "Nominated for 2 Oscars. Another 38 wins & 85 nominations.", "Genre": "Action, Adventure, Sci-Fi", "imdbRating": "8.1", "Language": "English", "Country": "USA, UK", "Synopsis": "After stealing a mysterious orb in the far reaches of outer space, Peter Quill from Earth, is now the main target of a manhunt led by the villain known as Ronan the Accuser. To help fight Ronan and his team and save the galaxy from his power, Quill creates a team of space heroes known as the \"Guardians of the Galaxy\" to save the world.", "Runtime": "121 min", "Trailer": "https://www.youtube.com/watch?v=89yh3vYs-zo", "imdbID": "tt2015381", "Metascore": "76", "Year": "2014"}, {"Plot": "Earth's mightiest heroes must come together and learn to fight as a team if they are to stop the mischievous Loki and his alien army from enslaving humanity.", "Rated": "PG-13", "Title": "The Avengers", "Writer": "Joss Whedon (screenplay), Zak Penn (story), Joss Whedon (story)", "Actors": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth", "Type": "movie", "imdbVotes": "847609", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTk2NTI1MTU4N15BMl5BanBnXkFtZTcwODg0OTY0Nw@@._V1_SX300.jpg", "Director": "Joss Whedon", "Released": "4 May 2012", "Awards": "Nominated for 1 Oscar. Another 31 wins & 66 nominations.", "Genre": "Action, Adventure, Sci-Fi", "imdbRating": "8.2", "Language": "English, Russian", "Country": "USA", "Synopsis": "Nick Fury is director of S.H.I.E.L.D, an international peace keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster.", "Runtime": "143 min", "Trailer": "https://www.youtube.com/watch?v=eOrNdBpGMv8", "imdbID": "tt0848228", "Metascore": "69", "Year": "2012"}, {"Plot": "An ex-hitman comes out of retirement to track down the gangsters that took everything from him.", "Rated": "R", "Title": "John Wick", "Writer": "Derek Kolstad (screenplay)", "Actors": "Keanu Reeves, Michael Nyqvist, Alfie Allen, Willem Dafoe", "Type": "movie", "imdbVotes": "173486", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTU2NjA1ODgzMF5BMl5BanBnXkFtZTgwMTM2MTI4MjE@._V1_SX300.jpg", "Director": "Chad Stahelski, David Leitch", "Released": "24 Oct 2014", "Awards": "5 wins & 3 nominations.", "Genre": "Action, Thriller", "imdbRating": "7.2", "Language": "English, Russian, Hungarian", "Country": "USA", "Synopsis": "John Wick is a mob hit man who, upon falling in love, quits. 5 years later, his wife dies and to make sure he's not alone she arranges for a dog to be brought to him after her death. Later, some men wanting his car break in and beat him up and kill his dog. When he recovers, he sets to get the ones who killed his dog. He learns that the leader is the son of his former employer. And the man wanting to protect his son, tries to take care of Wick but he's still as good as he was.", "Runtime": "101 min", "Trailer": "https://www.youtube.com/watch?v=2AUmvWm5ZDQ", "imdbID": "tt2911666", "Metascore": "68", "Year": "2014"}, {"Plot": "A poor and passionate young man falls in love with a rich young woman and gives her a sense of freedom. They soon are separated by their social differences.", "Rated": "PG-13", "Title": "The Notebook", "Writer": "Jeremy Leven (screenplay), Jan Sardi (adaptation), Nicholas Sparks (novel)", "Actors": "Tim Ivey, Gena Rowlands, Starletta DuPois, James Garner", "Type": "movie", "imdbVotes": "352028", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTk3OTM5Njg5M15BMl5BanBnXkFtZTYwMzA0ODI3._V1_SX300.jpg", "Director": "Nick Cassavetes", "Released": "25 Jun 2004", "Awards": "11 wins & 7 nominations.", "Genre": "Drama, Romance", "imdbRating": "7.9", "Language": "English", "Country": "USA", "Synopsis": "In a nursing home, resident Duke reads a romance story for an old woman who has senile dementia with memory loss. In the late 1930s, wealthy seventeen year-old Allie Hamilton is spending summer vacation in Seabrook. Local worker Noah Calhoun meets Allie at a carnival and they soon fall in love with each other. One day, Noah brings Allie to an ancient house that he dreams of buying and restoring and they attempt to make love but get interrupted by their friend. Allie's parents do not approve of their romance since Noah belongs to another social class, and they move to New York with her. Noah writes 365 letters (A Year) to Allie, but her mother Anne Hamilton does not deliver them to her daughter. Three years later, the United States joins the World War II and Noah and his best friend Fin enlist in the army, and Allie works as an army nurse. She meets injured soldier Lon Hammond in the hospital. After the war, they meet each other again going on dates and then, Lon, who is wealthy and handsome, proposes. Meanwhile Noah buys and restores the old house and many people want to buy it. When Allie accidentally sees the photo of Noah and his house in a newspaper, she feels divided between her first love and her commitment with Lon. Meanwhile Duke stops reading to the old lady since his children are visiting him in the nursing home.", "Runtime": "123 min", "Trailer": "https://www.youtube.com/watch?v=FC6biTjEyZw", "imdbID": "tt0332280", "Metascore": "53", "Year": "2004"}, {"Plot": "A lonely doctor who once occupied an unusual lakeside home begins exchanging love letters with its former resident, a frustrated architect. They must try to unravel the mystery behind their extraordinary romance before it's too late.", "Rated": "PG", "Title": "The Lake House", "Writer": "David Auburn (screenplay), Eun-Jeong Kim (motion picture \"Siworae\"), Ji-na Yeo (motion picture \"Siworae\")", "Actors": "Keanu Reeves, Sandra Bullock, Christopher Plummer, Ebon Moss-Bachrach", "Type": "movie", "imdbVotes": "105505", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTYxMTgxNDI3MV5BMl5BanBnXkFtZTcwMzIxMTIzMw@@._V1_SX300.jpg", "Director": "Alejandro Agresti", "Released": "16 Jun 2006", "Awards": "2 wins & 2 nominations.", "Genre": "Drama, Fantasy, Romance", "imdbRating": "6.8", "Language": "English", "Country": "USA, Australia", "Synopsis": "When two people \"connect\" the bond between them can be so pure and simple as to stir hearts in heaven. When they connect in all the right places at all the wrong times, heaven weeps for broken hearts. To heal these broken hearts, heaven breaks time.", "Runtime": "99 min", "Trailer": "https://www.youtube.com/watch?v=V02lqEpbk2Y", "imdbID": "tt0410297", "Metascore": "52", "Year": "2006"}, {"Plot": "Enter the land of Tinker Bell and her four best fairy friends.", "Rated": "G", "Title": "Tinker Bell", "Writer": "J.M. Barrie (characters), Jeffrey M. Howard, Bradley Raymond (story)", "Actors": "Mae Whitman, Kristin Chenoweth, Raven-Symoné, Lucy Liu", "Type": "movie", "imdbVotes": "7500", "Poster": "http://ia.media-imdb.com/images/M/MV5BMjA4NTQzMDQ2MV5BMl5BanBnXkFtZTcwNzQwODQ2MQ@@._V1_SX300.jpg", "Director": "Bradley Raymond", "Released": "28 Oct 2008", "Awards": "N/A", "Genre": "Animation, Adventure, Family", "imdbRating": "6.9", "Language": "English", "Country": "USA", "Synopsis": "Enter the land of Tinker Bell and her four best fairy friends.", "Runtime": "78 min", "Trailer": "https://www.youtube.com/watch?v=g0CTqqTkXH8", "imdbID": "tt0823671", "Metascore": "N/A", "Year": "2008"}, {"Plot": "A manipulative Southern belle carries on a turbulent affair with a blockade runner during the American Civil War.", "Rated": "G", "Title": "Gone with the Wind", "Writer": "Margaret Mitchell (story), Sidney Howard (screen play)", "Actors": "Thomas Mitchell, Barbara O'Neil, Vivien Leigh, Evelyn Keyes", "Type": "movie", "imdbVotes": "190427", "Poster": "http://ia.media-imdb.com/images/M/MV5BNDUwMjAxNTU1MF5BMl5BanBnXkFtZTgwMzg4NzMxMDE@._V1_SX300.jpg", "Director": "Victor Fleming, George Cukor, Sam Wood", "Released": "17 Jan 1940", "Awards": "Won 8 Oscars. Another 11 wins & 6 nominations.", "Genre": "Drama, Romance, War", "imdbRating": "8.2", "Language": "English", "Country": "USA", "Synopsis": "Scarlett is a woman who can deal with a nation at war, Atlanta burning, the Union Army carrying off everything from her beloved Tara, the carpetbaggers who arrive after the war. Scarlett is beautiful. She has vitality. But Ashley, the man she has wanted for so long, is going to marry his placid cousin, Melanie. Mammy warns Scarlett to behave herself at the party at Twelve Oaks. There is a new man there that day, the day the Civil War begins. Rhett Butler. Scarlett does not know he is in the room when she pleads with Ashley to choose her instead of Melanie.", "Runtime": "238 min", "Trailer": "https://www.youtube.com/watch?v=OFu-jemU-bA", "imdbID": "tt0031381", "Metascore": "N/A", "Year": "1939"}, {"Plot": "A young New York socialite becomes interested in a young man who has moved into her apartment building.", "Rated": "NOT RATED", "Title": "Breakfast at Tiffany's", "Writer": "Truman Capote (based on the novel by), George Axelrod (screenplay)", "Actors": "Audrey Hepburn, George Peppard, Patricia Neal, Buddy Ebsen", "Type": "movie", "imdbVotes": "109134", "Poster": "http://ia.media-imdb.com/images/M/MV5BMzg3NTI2NzU2NF5BMl5BanBnXkFtZTcwMjQxMTQ5OQ@@._V1_SX300.jpg", "Director": "Blake Edwards", "Released": "4 Nov 1961", "Awards": "Won 2 Oscars. Another 14 wins & 8 nominations.", "Genre": "Comedy, Drama, Romance", "imdbRating": "7.8", "Language": "English, Portuguese", "Country": "USA", "Synopsis": "Struggling writer Paul Varjak moves into a New York apartment building and becomes intrigued by his pretty, quirky neighbor Holly Golightly. Holly's lifestyle confuses and fascinates Paul; in public she flits through parties with a sexy, sophisticated air, but when they're alone she changes into a sweetly vulnerable bundle of neuroses.", "Runtime": "115 min", "Trailer": "https://www.youtube.com/watch?v=urQVzgEO_w8", "imdbID": "tt0054698", "Metascore": "76", "Year": "1961"}, {"Plot": "A Paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home..", "Rated": "PG-13", "Title": "Avatar", "Writer": "James Cameron", "Actors": "Sam Worthington, Zoe Saldana, Sigourney Weaver, Stephen Lang", "Type": "movie", "imdbVotes": "793275", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTYwOTEwNjAzMl5BMl5BanBnXkFtZTcwODc5MTUwMw@@._V1_SX300.jpg", "Director": "James Cameron", "Released": "18 Dec 2009", "Awards": "Won 3 Oscars. Another 83 wins & 106 nominations.", "Genre": "Action, Adventure, Fantasy", "imdbRating": "7.9", "Language": "English, Spanish", "Country": "USA, UK", "Synopsis": "When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid \"Na'vi\" in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers intel for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an \"avatar\" identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora.", "Runtime": "162 min", "Trailer": "https://www.youtube.com/watch?v=5PSNL1qE6VY", "imdbID": "tt0499549", "Metascore": "83", "Year": "2009"}, {"Plot": "When Blu, a domesticated macaw from small-town Minnesota, meets the fiercely independent Jewel, he takes off on an adventure to Rio de Janeiro with this bird of his dreams.", "Rated": "G", "Title": "Rio", "Writer": "Carlos Saldanha (story), Earl Richey Jones (story), Todd R. Jones (story), Don Rhymer (screenplay), Joshua Sternin (screenplay), Jennifer Ventimilia (screenplay), Sam Harper (screenplay)", "Actors": "Karen Disher, Jason Fricchione, Sofia Scarpa Saldanha, Leslie Mann", "Type": "movie", "imdbVotes": "147098", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTU2MDY3MzAzMl5BMl5BanBnXkFtZTcwMTg0NjM5NA@@._V1_SX300.jpg", "Director": "Carlos Saldanha", "Released": "15 Apr 2011", "Awards": "Nominated for 1 Oscar. Another 3 wins & 28 nominations.", "Genre": "Animation, Adventure, Comedy", "imdbRating": "7.0", "Language": "English, Portuguese", "Country": "USA", "Synopsis": "In Rio de Janeiro, baby macaw, Blu, is captured by dealers and smuggled to the USA. While driving through Moose Lake, Minnesota, the truck that is transporting Blu accidentally drops Blu's box on the road. A girl, Linda, finds the bird and raises him with love. Fifteen years later, Blu is a domesticated and intelligent bird that does not fly and lives a comfortable life with bookshop owner Linda. Out of the blue, clumsy Brazilian ornithologist, Tulio, visits Linda and explains that Blu is the last male of his species, and he has a female called Jewel in Rio de Janeiro. He invites Linda to bring Blu to Rio so that he and Jewel can save their species. Linda travels with Blu and Tulio to Rio de Janeiro and they leave Blu and Jewel in a large cage in the institute where Tulio works. While they are having dinner, smugglers break into the institute and steal Blu and Jewel to sell them. Linda and Tulio look everywhere for Blu, who is chained to Jewel and hidden in a slum. Meanwhile, Jewel and Blu escape from their captors and befriend a group of birds that help them to get rid of the chains. It is Carnival and the smugglers and mean cockatoo, Nigel, do not intend to give up Blu and Jewel, and chase the birds through the crowded streets.", "Runtime": "96 min", "Trailer": "https://www.youtube.com/watch?v=Bf6zeRwk5LE", "imdbID": "tt1436562", "Metascore": "63", "Year": "2011"}, {"Plot": "A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic.", "Rated": "R", "Title": "Lucy", "Writer": "Luc Besson", "Actors": "Scarlett Johansson, Morgan Freeman, Min-sik Choi, Amr Waked", "Type": "movie", "imdbVotes": "259275", "Poster": "http://ia.media-imdb.com/images/M/MV5BODcxMzY3ODY1NF5BMl5BanBnXkFtZTgwNzg1NDY4MTE@._V1_SX300.jpg", "Director": "Luc Besson", "Released": "25 Jul 2014", "Awards": "2 wins & 6 nominations.", "Genre": "Action, Sci-Fi, Thriller", "imdbRating": "6.4", "Language": "English, French, Spanish, Korean, Chinese", "Country": "France", "Synopsis": "It was supposed to be a simple job. All Lucy had to do was deliver a mysterious briefcase to Mr. Jang. But immediately Lucy is caught up in a nightmarish deal where she is captured and turned into a drug mule for a new and powerful synthetic drug. When the bag she is carrying inside of her stomach leaks, Lucy's body undergoes unimaginable changes that begins to unlock her mind's full potential. With her new-found powers, Lucy turns into a merciless warrior intent on getting back at her captors. She receives invaluable help from Professor Norman, the leading authority on the human mind, and French police captain Pierre Del Rio.", "Runtime": "89 min", "Trailer": "https://www.youtube.com/watch?v=MVt32qoyhi0", "imdbID": "tt2872732", "Metascore": "61", "Year": "2014"}, {"Plot": "A mysterious woman, known as Madame M, kidnaps forty pre-teen girls and transports them to a remote island to train them as the most deadly assassins. CIA operative Jack Chen follows the ...", "Rated": "R", "Title": "Naked Weapon", "Writer": "Jing Wong", "Actors": "Marit Thoresen, Almen Pui-Ha Wong, Daniel Wu, Natalie Kyoko Waters", "Type": "movie", "imdbVotes": "5448", "Poster": "http://ia.media-imdb.com/images/M/MV5BMjE1Mjc5OTY3NF5BMl5BanBnXkFtZTcwNzg2MjAzMQ@@._V1_SX300.jpg", "Director": "Siu-Tung Ching", "Released": "15 Nov 2002", "Awards": "N/A", "Genre": "Action, Drama, Romance", "imdbRating": "5.7", "Language": "English, Cantonese", "Country": "Hong Kong", "Synopsis": "A mysterious woman, known as Madame M, kidnaps forty pre-teen girls and transports them to a remote island to train them as the most deadly assassins. CIA operative Jack Chen follows the case for 6 years with no leads, but when a series of assassinations begin to occur, Jack suspects that Madame M is back in business.", "Runtime": "90 min", "Trailer": "https://www.youtube.com/watch?v=yHEamqsx2hg", "imdbID": "tt0341495", "Metascore": "N/A", "Year": "2002"}, {"Plot": "A conflict of interest between two high-kicking assassin sisters is complicated as they're pursued by the criminals who hired them and an equally high-kicking female cop.", "Rated": "R", "Title": "So Close", "Writer": "Jeffrey Lau", "Actors": "Qi Shu, Wei Zhao, Karen Mok, Seung-heon Song", "Type": "movie", "imdbVotes": "6152", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTIzMzE3MzA0NV5BMl5BanBnXkFtZTcwNTYxNTAwMQ@@._V1_SX300.jpg", "Director": "Corey Yuen", "Released": "12 Sep 2002", "Awards": "2 nominations.", "Genre": "Action, Adventure, Comedy", "imdbRating": "6.8", "Language": "Mandarin, Cantonese, English", "Country": "Hong Kong", "Synopsis": "The brothers Chow Nunn and Chow Lui's giant computer company is facing a tense crisis - a powerful computer virus is rapidly wiping out their computer network. At the last minute a cyber-friend arrives to join the battle. The mysterious 'Angel.com' battles the virus and saves the company. Invited by Chow Lui for a visit in person, Angel.com arrives in the form of the beautiful Lynn. But it turns out Lynn is a professional assassin with amazing high-tech and kung fu skills. She kills Chow Lui with cyanide hidden in a pair of sunglasses. She's aided by her sister Sue, who operates the pair's World Panorama surveillance system, which allows them to tap into any video security system in the world. Young cop Kong Yat Hong and her partner Mark are put on the case. Hong has a brilliant mind and immediately senses she's dealing with a killer with very special skills. Realizing they are facing a tough adversary, Lynn and Sue become fascinated with Hong as well. Lynn runs into Yan, the cousin of an old friend who died. Lynn and Yan shared an unspoken love in the past which is now rekindled in the open, and Lynn begins to question whether she wants to continue to be an assassin. Chow Nunn was behind his older brother's death. He hired Angel.com to kill Lui because Lui opposed Nunn's business plans, and also because Nunn is carrying on a secret affair with Lui's wife. But when Hong's investigation starts to point to Nunn, Nunn becomes worried and decides to hire Angel.com for another hit ^Ö only so he can double-cross them, wipe them out and prevent them from leading the police back to him. Yan tells Lynn he loves her and wants to marry her. After battling an attack by robbers with her amazing martial arts skills, she tells Yan her family's history. Her father invented the World Panorama for use by the authorities, but was turned down. Suspiciously, word of the device got out to the underworld and both parents were brutally killed in front of the girls' eyes by criminals eager to get their hands on the invention. Bereft at the loss of their parents and disillusioned with the law, the sisters turned professional assassins, killing criminals for other criminals. Lynn tells Sue she wants to stop their criminal life and get married ^Ö she won't accept Chow Nunn's order for the second killing. But Sue, angry and feeling abandoned by Lynn, decides to carry out the killing herself. Lynn realizes what's happening and rushes to save Sue, who doesn't have the skills to carry out the hit. They are attacked by Chow's men but escape. Now the assassin and the cop must join forces - so Sue can avenge her sister's death and Hong can prove her innocence in a spectacular confrontation at Chow Nunn's headquarters...", "Runtime": "111 min", "Trailer": "https://www.youtube.com/watch?v=4W9qldAtmvw", "imdbID": "tt0300620", "Metascore": "66", "Year": "2002"}, {"Plot": "A CIA agent goes on the run after a defector accuses her of being a Russian spy.", "Rated": "PG-13", "Title": "Salt", "Writer": "Kurt Wimmer", "Actors": "Angelina Jolie, Liev Schreiber, Chiwetel Ejiofor, Daniel Olbrychski", "Type": "movie", "imdbVotes": "225232", "Poster": "http://ia.media-imdb.com/images/M/MV5BMjIyODA2NDg4NV5BMl5BanBnXkFtZTcwMjg4NDAwMw@@._V1_SX300.jpg", "Director": "Phillip Noyce", "Released": "23 Jul 2010", "Awards": "Nominated for 1 Oscar. Another 4 wins & 15 nominations.", "Genre": "Action, Crime, Mystery", "imdbRating": "6.4", "Language": "English, Russian, Korean", "Country": "USA", "Synopsis": "Evelyn Salt is a CIA agent and highly respected by all, including her boss, Ted Winter. Out of the blue, a Russian spy walks into their offices and offers a vital piece of information: the President of Russia will be assassinated during his forthcoming visit to New York City to attend the funeral of the recently deceased U.S. Vice President. The name of the assassin: Evelyn Salt. Concerned about the safety of her husband, who she cannot contact, she goes on the run. Winter refuses to accept that she is a mole or a double agent but her actions begin to raise doubts. Just who is Evelyn Salt and what is she planning?", "Runtime": "100 min", "Trailer": "https://www.youtube.com/watch?v=QZ40WlshNwU", "imdbID": "tt0944835", "Metascore": "65", "Year": "2010"}, {"Plot": "In a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman.", "Rated": "R", "Title": "V for Vendetta", "Writer": "Andy Wachowski (screenplay), Lana Wachowski (screenplay), David Lloyd (graphic novel art)", "Actors": "Natalie Portman, Hugo Weaving, Stephen Rea, Stephen Fry", "Type": "movie", "imdbVotes": "691703", "Poster": "http://ia.media-imdb.com/images/M/MV5BOTI5ODc3NzExNV5BMl5BanBnXkFtZTcwNzYxNzQzMw@@._V1_SX300.jpg", "Director": "James McTeigue", "Released": "17 Mar 2006", "Awards": "10 wins & 23 nominations.", "Genre": "Action, Drama, Thriller", "imdbRating": "8.2", "Language": "English", "Country": "USA, UK, Germany", "Synopsis": "Tells the story of Evey Hammond and her unlikely but instrumental part in bringing down the fascist government that has taken control of a futuristic Great Britain. Saved from a life-and-death situation by a man in a Guy Fawkes mask who calls himself V, she learns a general summary of V's past and, after a time, decides to help him bring down those who committed the atrocities that led to Britain being in the shape that it is in.", "Runtime": "132 min", "Trailer": "https://www.youtube.com/watch?v=IHVzzxrPt1c", "imdbID": "tt0434409", "Metascore": "62", "Year": "2005"}, {"Plot": "A lawyer takes on a negligent homicide case involving a priest who performed an exorcism on a young girl.", "Rated": "PG-13", "Title": "The Exorcism of Emily Rose", "Writer": "Paul Harris Boardman, Scott Derrickson", "Actors": "Laura Linney, Tom Wilkinson, Campbell Scott, Jennifer Carpenter", "Type": "movie", "imdbVotes": "86325", "Poster": "http://ia.media-imdb.com/images/M/MV5BMTI2NTM5MjQ0Nl5BMl5BanBnXkFtZTcwNDAxNjAzMQ@@._V1_SX300.jpg", "Director": "Scott Derrickson", "Released": "9 Sep 2005", "Awards": "4 wins & 7 nominations.", "Genre": "Drama, Horror, Thriller", "imdbRating": "6.7", "Language": "English, Syriac, German, Greek, Hebrew, Latin, Aramaic", "Country": "USA", "Synopsis": "When a younger girl called Emily Rose dies, everyone puts blame on the exorcism which was performed on her by Father Moore prior to her death. The priest is arrested on suspicion of murder. The trail begins with lawyer Erin Bruner representing Moore, but it is not going to be easy, as no one wants to believe what Father Moore says is true.", "Runtime": "119 min", "Trailer": "https://www.youtube.com/watch?v=jsGIpxlgENY", "imdbID": "tt0404032", "Metascore": "46", "Year": "2005"}]